do

function run(msg, matches)
return [[ 
دستورات ربات :
1./AddBot [Invitelink] : اد کردن ربات در گرو بوسیله لینک حتی با ریپلای!
======================================================
2./bot + [botuserID] : مجاز کزدن یک ربات برای ماندن در گروه
3./bot - [botID] : حذف دسترسی بات برای ماندن در گروه
4./bot + : فعال سازی ضد ربات گروه
5./bot - : غیر فعال کردن ضد بات در گروه
=====================================================
6.Auto_Leave : این یک دستور نیست! ربات بعد از اد شدن در گروه نا مربوط خور بخ خود خارج میشود
=====================================================
7./block user [USERID] : بلاک کردن یک نفر !
=============================================
8.whitelist + : فعال سازی لیست سفید در گروه
9.whitelist - : غیر فعال کردن لیست سفید در گروه
10.whitelist + [ID] : اضافه کردن یک فرد به لیست سفید
11.whitelist - [ID] : حذف فرد از لیست سفید
12.whitelist group : اضافه کردن افراد یک گروه به لیست سفید
13.whitelist - member {ID} :حذف کردن فرداز لیست سفید گروه 
14.whitelist - group : حذف افراد یک گروه از لیست سفید
15.ban + [@USERNAME] :بن کردن فرد وقتی در گروه است
16.ban + [ID] : بن کردن یک فرد خارج از گزوه
17. ban - [ID] : آن بن کردن فرد 
18.globalban + {ID} :سوپر بن کردن فرد
18.globalban - [ID] :حذف سوپر بن فرد
19.kick [@USERNAME] : حذف فرد از گروه
19.kick [ID] : حذف فرد از گروه
برای اجرای دستورات این پلاگین از / و ! استفاده نکنید
======================================================
20./calc [numb] +or*or/[numb] :ماشین حساب
==============================================
21./Echo [whatever] : نمایش یک پیام
========================================
22./Feedback [TEXT] : ارسال نظر به سودو
=================================================
23./gps (city)\(ZONE) : یافتن یک منطقه در نقشه
==============================================
24./addgroup : اضافه کردن مدیریت گروه
25./add realm : اضافه کردن ریلیم
26./remgroup : حذف مدیریت گروه
27./rem realm : حذف ریلیم
28./rules : نمایش قوانین گروه
29./about : نمایش توضیحات گروه
30./setname [WHATEVER] : تنظیم نام گروه
40./setphoto : تنظیم عکس گروه
41./promote [@USERNAME] : ارتقا مقام فرد
42./promote : ارتقا مقام بوسیله ریپلای
43./clean [modlist][about][member][rules]: پاک کردن  مدیران ، توضیحات ، افراد و یا قوانین گروه
44./kill [chat][realm] : پاک کردن گروه و حذف همه
45./demote : از مام فرد با ریپلای
46./demote [@USERNAME] : ازل مقام فرد
47./set [NAME] [TEXT] : سیو کردن یک متن و نشان دادن آن
48./lock [member][name][photo][arabic][leave][bots][flood]
49./unlock [memb][name][photo][arabic][leave][bots][flood]
50./setowner {ID} : تنظیم فرد به عنوان صاحب گروه
51./setowner : تنظیم فرد به عنوان صاحب گروه با ریپلای
52./res [@USERNAME] ; دریافت آیدی کد فرد
52./owner : نمایش صاحب گروه
53./setgpowner [gpID] [ID] : فقط برای ادمین ها !
54./setflood [value] : تنظیم حساسیت به اسپم 
55./settings : نمایش تنظیمات گروه
56./modlist :نمایش مدیر های گروه
57./clink : ساخت/تازه سازی لینک
58./link : دریافت لینک گروه
59./kickinactive :کیک کردن افراد غیر فعال
60./kickinactive [ID] ;کیک کردن افراد غیر فعال
===========================================
61./map ... : دریافت نقشه منطقه
==========================================
62./maseage [ID] [TEXT] : فرستادن پیام برای یک نفر[adminonly]
====================================================
63./globalban @USERNAME : سوپر بن کردن فرد
64./globalban : سوپر بن کردن فرد با ریپلای
65./banlist : لیست افراد بن شده از گروه
66./ban @USERNAME : بن کردن فرد
67./kick : کیک کردن با ریپلای 
68./ban :بن کردن فرد با ریپلای
69./globalunban [ID] :سوپر بن کردن فرد
70./id :دریافت آیدی گروه
71./kickme : خروج از گروه
72./glbanlist : دریافت لیست افراد سوپر بن شده
============================================
73./S2A [TXT] : ارسال پیام به پی وی همه افراد گروه
74./bcgp [ID] [TEXT] : فرستادن پیام به گروه
====================================
75./sudo : سودو های ربات
=====================================
76./time [city] : دریافت زمان شهر
====================================
77./version : نمایش ورژن ربات
===========================================
78./all : همه چیز درباره گروه
=========================================
79./cgroup [id] : بستن گروه
=======================================
80./dic [word] : نمایش معنی کلمه به فارسی
===========================================
81./plug : نمایش لیست پلاگین ها
82./plug + [NAME] : فعال کردن پلاگین
83./plug - [NAME] : غیر فعال کردن پلاگین
84./plug - [NAME] gp : غیر فعال کردن پلاگین در گروه 
85./plug + [NAME] gp :فعال کردن پلاگین در گروه
==========================================
86./stats : آمار گروه در قالب یک فایل 
87./stats SBSS : آمار ربات
89./SBSS : درباره ربات
90./stats group [ID] : دریافت آمار گروه
=================================
91./tagall [txt] : تگ کردن افراد گروه و فرستادن پیام برای آنها
===============================
92./kickall [ID] : حذف همه افراد گروه
=========================================
93./toengsupport : لینک ساپورت
================================================== 
94./txt2img [TXT] : تبدیل متن به عکس
===========================================
more helps soon
you can use both "!" and "/"
our channell : @SBSS_Team
Master admin : @Mr_Ah_S
]]
end

return {
description = "Shows help for all Plugins Of infernalTG", 
patterns = {
"^[!/]help (all)$",
"^help (all)$"
}, 
run = run 
}

end
